{
  "model_type": "complexity",
  "architectures": ["ComplexityForCausalLM"],
  "vocab_size": 32000,
  "hidden_size": 1280,
  "intermediate_size": 3456,
  "num_hidden_layers": 20,
  "num_attention_heads": 16,
  "num_key_value_heads": 4,
  "num_experts": 4,
  "num_experts_per_tok": 2,
  "hidden_act": "silu",
  "max_position_embeddings": 2048,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-6,
  "use_cache": true,
  "pad_token_id": 1,
  "bos_token_id": 2,
  "eos_token_id": 0,
  "tie_word_embeddings": false,
  "rope_theta": 10000.0,
  "rope_scaling": null,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "mlp_bias": false,
  "torch_dtype": "bfloat16"
}
